thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_cpu_itm.h
//*****************************************************************************
//
// Register: CPU_ITM_O_STIM25
//
//*****************************************************************************
// Field:  [31:0] STIM25
//
// A write to this location causes data to be written into the FIFO if
// TER.STIMENA25 is set. Reading from the stimulus port returns the FIFO status
// in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not
// provide an atomic read-modify-write, so it's users responsibility to ensure
// exclusive read-modify-write if this ITM port is used concurrently by
// interrupts or other threads.
#define CPU_ITM_STIM25_STIM25_W 32
#define CPU_ITM_STIM25_STIM25_M 0xFFFFFFFF
#define CPU_ITM_STIM25_STIM25_S 0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM26
//
//*****************************************************************************
// Field:  [31:0] STIM26
//
// A write to this location causes data to be written into the FIFO if
// TER.STIMENA26 is set. Reading from the stimulus port returns the FIFO status
// in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not
// provide an atomic read-modify-write, so it's users responsibility to ensure
// exclusive read-modify-write if this ITM port is used concurrently by
// interrupts or other threads.
#define CPU_ITM_STIM26_STIM26_W 32
#define CPU_ITM_STIM26_STIM26_M 0xFFFFFFFF
#define CPU_ITM_STIM26_STIM26_S 0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM27
//
//*****************************************************************************
// Field:  [31:0] STIM27
//
// A write to this location causes data to be written into the FIFO if
// TER.STIMENA27 is set. Reading from the stimulus port returns the FIFO status
// in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not
// provide an atomic read-modify-write, so it's users responsibility to ensure
// exclusive read-modify-write if this ITM port is used concurrently by
// interrupts or other threads.
#define CPU_ITM_STIM27_STIM27_W 32
#define CPU_ITM_STIM27_STIM27_M 0xFFFFFFFF
#define CPU_ITM_STIM27_STIM27_S 0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM28
//
//*****************************************************************************
// Field:  [31:0] STIM28
//
// A write to this location causes data to be written into the FIFO if
// TER.STIMENA28 is set. Reading from the stimulus port returns the FIFO status
// in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not
// provide an atomic read-modify-write, so it's users responsibility to ensure
// exclusive read-modify-write if this ITM port is used concurrently by
// interrupts or other threads.
#define CPU_ITM_STIM28_STIM28_W 32
#define CPU_ITM_STIM28_STIM28_M 0xFFFFFFFF
#define CPU_ITM_STIM28_STIM28_S 0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM29
//
//*****************************************************************************
// Field:  [31:0] STIM29
//
// A write to this location causes data to be written into the FIFO if
// TER.STIMENA29 is set. Reading from the stimulus port returns the FIFO status
// in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not
// provide an atomic read-modify-write, so it's users responsibility to ensure
// exclusive read-modify-write if this ITM port is used concurrently by
// interrupts or other threads.
#define CPU_ITM_STIM29_STIM29_W 32
#define CPU_ITM_STIM29_STIM29_M 0xFFFFFFFF
#define CPU_ITM_STIM29_STIM29_S 0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM30
//
//*****************************************************************************
// Field:  [31:0] STIM30
//
// A write to this location causes data to be written into the FIFO if
// TER.STIMENA30 is set. Reading from the stimulus port returns the FIFO status
// in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not
// provide an atomic read-modify-write, so it's users responsibility to ensure
// exclusive read-modify-write if this ITM port is used concurrently by
// interrupts or other threads.
#define CPU_ITM_STIM30_STIM30_W 32
#define CPU_ITM_STIM30_STIM30_M 0xFFFFFFFF
#define CPU_ITM_STIM30_STIM30_S 0

//*****************************************************************************
//
// Register: CPU_ITM_O_STIM31
//
//*****************************************************************************
// Field:  [31:0] STIM31
//
// A write to this location causes data to be written into the FIFO if
// TER.STIMENA31 is set. Reading from the stimulus port returns the FIFO status
// in bit [0]: 0 = full, 1 = not full. The polled FIFO interface does not
// provide an atomic read-modify-write, so it's users responsibility to ensure
// exclusive read-modify-write if this ITM port is used concurrently by
// interrupts or other threads.
#define CPU_ITM_STIM31_STIM31_W 32
#define CPU_ITM_STIM31_STIM31_M 0xFFFFFFFF
#define CPU_ITM_STIM31_STIM31_S 0

//*****************************************************************************
//
// Register: CPU_ITM_O_TER
//
//*****************************************************************************
// Field:    [31] STIMENA31
//
// Bit mask to enable tracing on ITM stimulus port 31.
#define CPU_ITM_TER_STIMENA31 0x80000000
#define CPU_ITM_TER_STIMENA31_BITN 31
#define CPU_ITM_TER_STIMENA31_M 0x80000000
#define CPU_ITM_TER_STIMENA31_S 31

// Field:    [30] STIMENA30
//
// Bit mask to enable tracing on ITM stimulus port 30.
#define CPU_ITM_TER_STIMENA30 0x40000000
#define CPU_ITM_TER_STIMENA30_BITN 30
#define CPU_ITM_TER_STIMENA30_M 0x40000000
#define CPU_ITM_TER_STIMENA30_S 30

// Field:    [29] STIMENA29
//
// Bit mask to enable tracing on ITM stimulus port 29.
#define CPU_ITM_TER_STIMENA29 0x20000000
#define CPU_ITM_TER_STIMENA29_BITN 29
#define CPU_ITM_TER_STIMENA29_M 0x20000000
#define CPU_ITM_TER_STIMENA29_S 29

// Field:    [28] STIMENA28
//
// Bit mask to enable tracing on ITM stimulus port 28.
#define CPU_ITM_TER_STIMENA28 0x10000000
#define CPU_ITM_TER_STIMENA28_BITN 28
#define CPU_ITM_TER_STIMENA28_M 0x10000000
#define CPU_ITM_TER_STIMENA28_S 28

// Field:    [27] STIMENA27
//
// Bit mask to enable tracing on ITM stimulus port 27.
#define CPU_ITM_TER_STIMENA27 0x08000000
#define CPU_ITM_TER_STIMENA27_BITN 27
#define CPU_ITM_TER_STIMENA27_M 0x08000000
#define CPU_ITM_TER_STIMENA27_S 27

// Field:    [26] STIMENA26
//
// Bit mask to enable tracing on ITM stimulus port 26.
#define CPU_ITM_TER_STIMENA26 0x04000000
#define CPU_ITM_TER_STIMENA26_BITN 26
#define CPU_ITM_TER_STIMENA26_M 0x04000000
#define CPU_ITM_TER_STIMENA26_S 26

