thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_cpu_itm.h
// Field:    [25] STIMENA25
//
// Bit mask to enable tracing on ITM stimulus port 25.
#define CPU_ITM_TER_STIMENA25 0x02000000
#define CPU_ITM_TER_STIMENA25_BITN 25
#define CPU_ITM_TER_STIMENA25_M 0x02000000
#define CPU_ITM_TER_STIMENA25_S 25

// Field:    [24] STIMENA24
//
// Bit mask to enable tracing on ITM stimulus port 24.
#define CPU_ITM_TER_STIMENA24 0x01000000
#define CPU_ITM_TER_STIMENA24_BITN 24
#define CPU_ITM_TER_STIMENA24_M 0x01000000
#define CPU_ITM_TER_STIMENA24_S 24

// Field:    [23] STIMENA23
//
// Bit mask to enable tracing on ITM stimulus port 23.
#define CPU_ITM_TER_STIMENA23 0x00800000
#define CPU_ITM_TER_STIMENA23_BITN 23
#define CPU_ITM_TER_STIMENA23_M 0x00800000
#define CPU_ITM_TER_STIMENA23_S 23

// Field:    [22] STIMENA22
//
// Bit mask to enable tracing on ITM stimulus port 22.
#define CPU_ITM_TER_STIMENA22 0x00400000
#define CPU_ITM_TER_STIMENA22_BITN 22
#define CPU_ITM_TER_STIMENA22_M 0x00400000
#define CPU_ITM_TER_STIMENA22_S 22

// Field:    [21] STIMENA21
//
// Bit mask to enable tracing on ITM stimulus port 21.
#define CPU_ITM_TER_STIMENA21 0x00200000
#define CPU_ITM_TER_STIMENA21_BITN 21
#define CPU_ITM_TER_STIMENA21_M 0x00200000
#define CPU_ITM_TER_STIMENA21_S 21

// Field:    [20] STIMENA20
//
// Bit mask to enable tracing on ITM stimulus port 20.
#define CPU_ITM_TER_STIMENA20 0x00100000
#define CPU_ITM_TER_STIMENA20_BITN 20
#define CPU_ITM_TER_STIMENA20_M 0x00100000
#define CPU_ITM_TER_STIMENA20_S 20

// Field:    [19] STIMENA19
//
// Bit mask to enable tracing on ITM stimulus port 19.
#define CPU_ITM_TER_STIMENA19 0x00080000
#define CPU_ITM_TER_STIMENA19_BITN 19
#define CPU_ITM_TER_STIMENA19_M 0x00080000
#define CPU_ITM_TER_STIMENA19_S 19

// Field:    [18] STIMENA18
//
// Bit mask to enable tracing on ITM stimulus port 18.
#define CPU_ITM_TER_STIMENA18 0x00040000
#define CPU_ITM_TER_STIMENA18_BITN 18
#define CPU_ITM_TER_STIMENA18_M 0x00040000
#define CPU_ITM_TER_STIMENA18_S 18

// Field:    [17] STIMENA17
//
// Bit mask to enable tracing on ITM stimulus port 17.
#define CPU_ITM_TER_STIMENA17 0x00020000
#define CPU_ITM_TER_STIMENA17_BITN 17
#define CPU_ITM_TER_STIMENA17_M 0x00020000
#define CPU_ITM_TER_STIMENA17_S 17

// Field:    [16] STIMENA16
//
// Bit mask to enable tracing on ITM stimulus port 16.
#define CPU_ITM_TER_STIMENA16 0x00010000
#define CPU_ITM_TER_STIMENA16_BITN 16
#define CPU_ITM_TER_STIMENA16_M 0x00010000
#define CPU_ITM_TER_STIMENA16_S 16

// Field:    [15] STIMENA15
//
// Bit mask to enable tracing on ITM stimulus port 15.
#define CPU_ITM_TER_STIMENA15 0x00008000
#define CPU_ITM_TER_STIMENA15_BITN 15
#define CPU_ITM_TER_STIMENA15_M 0x00008000
#define CPU_ITM_TER_STIMENA15_S 15

// Field:    [14] STIMENA14
//
// Bit mask to enable tracing on ITM stimulus port 14.
#define CPU_ITM_TER_STIMENA14 0x00004000
#define CPU_ITM_TER_STIMENA14_BITN 14
#define CPU_ITM_TER_STIMENA14_M 0x00004000
#define CPU_ITM_TER_STIMENA14_S 14

// Field:    [13] STIMENA13
//
// Bit mask to enable tracing on ITM stimulus port 13.
#define CPU_ITM_TER_STIMENA13 0x00002000
#define CPU_ITM_TER_STIMENA13_BITN 13
#define CPU_ITM_TER_STIMENA13_M 0x00002000
#define CPU_ITM_TER_STIMENA13_S 13

// Field:    [12] STIMENA12
//
// Bit mask to enable tracing on ITM stimulus port 12.
#define CPU_ITM_TER_STIMENA12 0x00001000
#define CPU_ITM_TER_STIMENA12_BITN 12
#define CPU_ITM_TER_STIMENA12_M 0x00001000
#define CPU_ITM_TER_STIMENA12_S 12

// Field:    [11] STIMENA11
//
// Bit mask to enable tracing on ITM stimulus port 11.
#define CPU_ITM_TER_STIMENA11 0x00000800
#define CPU_ITM_TER_STIMENA11_BITN 11
#define CPU_ITM_TER_STIMENA11_M 0x00000800
#define CPU_ITM_TER_STIMENA11_S 11

// Field:    [10] STIMENA10
//
// Bit mask to enable tracing on ITM stimulus port 10.
#define CPU_ITM_TER_STIMENA10 0x00000400
#define CPU_ITM_TER_STIMENA10_BITN 10
#define CPU_ITM_TER_STIMENA10_M 0x00000400
#define CPU_ITM_TER_STIMENA10_S 10

// Field:     [9] STIMENA9
//
// Bit mask to enable tracing on ITM stimulus port 9.
#define CPU_ITM_TER_STIMENA9 0x00000200
#define CPU_ITM_TER_STIMENA9_BITN 9
#define CPU_ITM_TER_STIMENA9_M 0x00000200
#define CPU_ITM_TER_STIMENA9_S 9

// Field:     [8] STIMENA8
//
// Bit mask to enable tracing on ITM stimulus port 8.
#define CPU_ITM_TER_STIMENA8 0x00000100
#define CPU_ITM_TER_STIMENA8_BITN 8
#define CPU_ITM_TER_STIMENA8_M 0x00000100
#define CPU_ITM_TER_STIMENA8_S 8

// Field:     [7] STIMENA7
//
// Bit mask to enable tracing on ITM stimulus port 7.
#define CPU_ITM_TER_STIMENA7 0x00000080
#define CPU_ITM_TER_STIMENA7_BITN 7
#define CPU_ITM_TER_STIMENA7_M 0x00000080
#define CPU_ITM_TER_STIMENA7_S 7

// Field:     [6] STIMENA6
//
// Bit mask to enable tracing on ITM stimulus port 6.
#define CPU_ITM_TER_STIMENA6 0x00000040
#define CPU_ITM_TER_STIMENA6_BITN 6
#define CPU_ITM_TER_STIMENA6_M 0x00000040
#define CPU_ITM_TER_STIMENA6_S 6

// Field:     [5] STIMENA5
//
// Bit mask to enable tracing on ITM stimulus port 5.
#define CPU_ITM_TER_STIMENA5 0x00000020
#define CPU_ITM_TER_STIMENA5_BITN 5
#define CPU_ITM_TER_STIMENA5_M 0x00000020
#define CPU_ITM_TER_STIMENA5_S 5

// Field:     [4] STIMENA4
//
// Bit mask to enable tracing on ITM stimulus port 4.
#define CPU_ITM_TER_STIMENA4 0x00000010
#define CPU_ITM_TER_STIMENA4_BITN 4
#define CPU_ITM_TER_STIMENA4_M 0x00000010
#define CPU_ITM_TER_STIMENA4_S 4

// Field:     [3] STIMENA3
//
// Bit mask to enable tracing on ITM stimulus port 3.
#define CPU_ITM_TER_STIMENA3 0x00000008
#define CPU_ITM_TER_STIMENA3_BITN 3
#define CPU_ITM_TER_STIMENA3_M 0x00000008
#define CPU_ITM_TER_STIMENA3_S 3

// Field:     [2] STIMENA2
//
// Bit mask to enable tracing on ITM stimulus port 2.
#define CPU_ITM_TER_STIMENA2 0x00000004
#define CPU_ITM_TER_STIMENA2_BITN 2
#define CPU_ITM_TER_STIMENA2_M 0x00000004
#define CPU_ITM_TER_STIMENA2_S 2

// Field:     [1] STIMENA1
//
// Bit mask to enable tracing on ITM stimulus port 1.
#define CPU_ITM_TER_STIMENA1 0x00000002
#define CPU_ITM_TER_STIMENA1_BITN 1
#define CPU_ITM_TER_STIMENA1_M 0x00000002
#define CPU_ITM_TER_STIMENA1_S 1

