thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_cpu_itm.h
// Field:     [0] STIMENA0
//
// Bit mask to enable tracing on ITM stimulus port 0.
#define CPU_ITM_TER_STIMENA0 0x00000001
#define CPU_ITM_TER_STIMENA0_BITN 0
#define CPU_ITM_TER_STIMENA0_M 0x00000001
#define CPU_ITM_TER_STIMENA0_S 0

//*****************************************************************************
//
// Register: CPU_ITM_O_TPR
//
//*****************************************************************************
// Field:   [3:0] PRIVMASK
//
// Bit mask to enable unprivileged (User) access to ITM stimulus ports:
//
// Bit [0] enables stimulus ports 0, 1, ..., and 7.
// Bit [1] enables stimulus ports 8, 9, ..., and 15.
// Bit [2] enables stimulus ports 16, 17, ..., and 23.
// Bit [3] enables stimulus ports 24, 25, ..., and 31.
//
// 0: User access allowed to stimulus ports
// 1: Privileged access only to stimulus ports
#define CPU_ITM_TPR_PRIVMASK_W 4
#define CPU_ITM_TPR_PRIVMASK_M 0x0000000F
#define CPU_ITM_TPR_PRIVMASK_S 0

//*****************************************************************************
//
// Register: CPU_ITM_O_TCR
//
//*****************************************************************************
// Field:    [23] BUSY
//
// Set when ITM events present and being drained.
#define CPU_ITM_TCR_BUSY 0x00800000
#define CPU_ITM_TCR_BUSY_BITN 23
#define CPU_ITM_TCR_BUSY_M 0x00800000
#define CPU_ITM_TCR_BUSY_S 23

// Field: [22:16] ATBID
//
// Trace Bus ID for CoreSight system. Optional identifier for multi-source
// trace stream formatting. If multi-source trace is in use, this field must be
// written with a non-zero value.
#define CPU_ITM_TCR_ATBID_W 7
#define CPU_ITM_TCR_ATBID_M 0x007F0000
#define CPU_ITM_TCR_ATBID_S 16

// Field:   [9:8] TSPRESCALE
//
// Timestamp prescaler
// ENUMs:
// DIV64                    Divide by 64
// DIV16                    Divide by 16
// DIV4                     Divide by 4
// NOPRESCALING             No prescaling
#define CPU_ITM_TCR_TSPRESCALE_W 2
#define CPU_ITM_TCR_TSPRESCALE_M 0x00000300
#define CPU_ITM_TCR_TSPRESCALE_S 8
#define CPU_ITM_TCR_TSPRESCALE_DIV64 0x00000300
#define CPU_ITM_TCR_TSPRESCALE_DIV16 0x00000200
#define CPU_ITM_TCR_TSPRESCALE_DIV4 0x00000100
#define CPU_ITM_TCR_TSPRESCALE_NOPRESCALING 0x00000000

// Field:     [4] SWOENA
//
// Enables asynchronous clocking of the timestamp counter (when TSENA = 1). If
// TSENA = 0, writing this bit to 1 does not enable asynchronous clocking of
// the timestamp counter.
//
// 0x0: Mode disabled. Timestamp counter uses system clock from the core and
// counts continuously.
// 0x1: Timestamp counter uses lineout (data related) clock from TPIU
// interface. The timestamp counter is held in reset while the output line is
// idle.
#define CPU_ITM_TCR_SWOENA 0x00000010
#define CPU_ITM_TCR_SWOENA_BITN 4
#define CPU_ITM_TCR_SWOENA_M 0x00000010
#define CPU_ITM_TCR_SWOENA_S 4

// Field:     [3] DWTENA
//
// Enables the DWT stimulus (hardware event packet emission to the TPIU from
// the DWT)
#define CPU_ITM_TCR_DWTENA 0x00000008
#define CPU_ITM_TCR_DWTENA_BITN 3
#define CPU_ITM_TCR_DWTENA_M 0x00000008
#define CPU_ITM_TCR_DWTENA_S 3

// Field:     [2] SYNCENA
//
// Enables synchronization packet transmission for a synchronous TPIU.
// CPU_DWT:CTRL.SYNCTAP must be configured for the correct synchronization
// speed.
#define CPU_ITM_TCR_SYNCENA 0x00000004
#define CPU_ITM_TCR_SYNCENA_BITN 2
#define CPU_ITM_TCR_SYNCENA_M 0x00000004
#define CPU_ITM_TCR_SYNCENA_S 2

// Field:     [1] TSENA
//
// Enables differential timestamps. Differential timestamps are emitted when a
// packet is written to the FIFO with a non-zero timestamp counter, and when
// the timestamp counter overflows. Timestamps are emitted during idle times
// after a fixed number of two million cycles. This provides a time reference
// for packets and inter-packet gaps. If SWOENA (bit [4]) is set, timestamps
// are triggered by activity on the internal trace bus only. In this case there
// is no regular timestamp output when the ITM is idle.
#define CPU_ITM_TCR_TSENA 0x00000002
#define CPU_ITM_TCR_TSENA_BITN 1
#define CPU_ITM_TCR_TSENA_M 0x00000002
#define CPU_ITM_TCR_TSENA_S 1

// Field:     [0] ITMENA
//
// Enables ITM. This is the master enable, and must be set before ITM Stimulus
// and Trace Enable registers can be written.
#define CPU_ITM_TCR_ITMENA 0x00000001
#define CPU_ITM_TCR_ITMENA_BITN 0
#define CPU_ITM_TCR_ITMENA_M 0x00000001
#define CPU_ITM_TCR_ITMENA_S 0

//*****************************************************************************
//
// Register: CPU_ITM_O_LAR
//
//*****************************************************************************
// Field:  [31:0] LOCK_ACCESS
//
// A privileged write of 0xC5ACCE55 enables more write access to Control
// Registers TER, TPR and TCR. An invalid write removes write access.
#define CPU_ITM_LAR_LOCK_ACCESS_W 32
#define CPU_ITM_LAR_LOCK_ACCESS_M 0xFFFFFFFF
#define CPU_ITM_LAR_LOCK_ACCESS_S 0

//*****************************************************************************
//
// Register: CPU_ITM_O_LSR
//
//*****************************************************************************
// Field:     [2] BYTEACC
//
// Reads 0 which means 8-bit lock access is not be implemented.
#define CPU_ITM_LSR_BYTEACC 0x00000004
#define CPU_ITM_LSR_BYTEACC_BITN 2
#define CPU_ITM_LSR_BYTEACC_M 0x00000004
#define CPU_ITM_LSR_BYTEACC_S 2

// Field:     [1] ACCESS
//
// Write access to component is blocked. All writes are ignored, reads are
// permitted.
#define CPU_ITM_LSR_ACCESS 0x00000002
#define CPU_ITM_LSR_ACCESS_BITN 1
#define CPU_ITM_LSR_ACCESS_M 0x00000002
#define CPU_ITM_LSR_ACCESS_S 1

// Field:     [0] PRESENT
//
// Indicates that a lock mechanism exists for this component.
#define CPU_ITM_LSR_PRESENT 0x00000001
#define CPU_ITM_LSR_PRESENT_BITN 0
#define CPU_ITM_LSR_PRESENT_M 0x00000001
#define CPU_ITM_LSR_PRESENT_S 0

#endif // __CPU_ITM__
